In [1]:
import numpy as np
import pandas as pd

In [5]:
df = pd.DataFrame(np.random.randn(5,4),
                 columns=['c1','c2','c3','c4'])
df
df.loc[[0,1],'c1'] = None
df.loc[2,'c2'] = None
df

         c1        c2        c3        c4
0       NaN -0.415285  0.314127  0.519907
1       NaN  0.184274 -0.368970  0.471412
2 -0.233229       NaN  0.945820  0.428225
3  1.303492  0.599873  0.244327 -0.344660
4 -0.252558 -1.080600 -0.831580  0.301058

In [6]:
# 결측값이 있는 행 제거
df.dropna(axis = 0)

         c1        c2        c3        c4
3  1.303492  0.599873  0.244327 -0.344660
4 -0.252558 -1.080600 -0.831580  0.301058

In [7]:
# 결측값이 있는 열 전체 제거
df.dropna(axis=1)

         c3        c4
0  0.314127  0.519907
1 -0.368970  0.471412
2  0.945820  0.428225
3  0.244327 -0.344660
4 -0.831580  0.301058

In [9]:
# c1열에 대해 결측값이 있는 행을 제거
print(df)
df['c1'].dropna()

         c1        c2        c3        c4
0       NaN -0.415285  0.314127  0.519907
1       NaN  0.184274 -0.368970  0.471412
2 -0.233229       NaN  0.945820  0.428225
3  1.303492  0.599873  0.244327 -0.344660
4 -0.252558 -1.080600 -0.831580  0.301058

2   -0.233229
3    1.303492
4   -0.252558
Name: c1, dtype: float64

In [10]:
df[['c1','c2','c3']].dropna()

         c1        c2        c3
3  1.303492  0.599873  0.244327
4 -0.252558 -1.080600 -0.831580

In [11]:
df[['c1','c2','c3']].dropna(axis=1)

         c3
0  0.314127
1 -0.368970
2  0.945820
3  0.244327
4 -0.831580